{
  "product_id": "MBL-077",
  "product_name": "McZinc (Hepta)",
  "product_image": "images/McZinc_(Hepta).jpg",
  "medicine_name": "Zinc Sulphate Hepta Hydrate",
  "category_name": "Fertilizers (Macro & Micro)",
  "description": "McZinc Hepta is a zinc fertilizer containing Zinc Sulphate Heptahydrate with 21% Zn and 10.5% S. Essential for proper plant growth and prevents zinc deficiency symptoms.",
  "application_rates": "3-5 Kg /acre, but if Zn deficiency symptom appears the dose may be doubled.; Uses McZinc Gold as broadcast during final land preparation & before sowing/transplanting.; In case of rice, this can be use as top dressing mixed with urea when the plant age is 20-25 DAT.; If didn't use during final land preparation, no tension, you can spray @ 30 gm / 10 Lit of water over the plants.; McZinc Gold can be mixed with any other fertilizers for use except Phosphate.",
  "frequency_of_use": "Apply during final land preparation or as top dressing 20-25 days after transplanting for rice",
  "side_effect": "Generally safe when used as directed. Avoid excessive application as it may cause zinc toxicity. Do not mix with phosphate fertilizers. Store in dry place away from children.",
  "crops_pests": "Rice, Wheat, Maize, Cotton, Tea, Mustard, Potato, Onion, Chili, Mango, Banana, Betel leaf, Brinjal, Cabbage, cauliflower etc.",
  "crops": "Rice, Wheat, Maize, Cotton, Tea, Mustard, Potato, Onion, Chili, Mango, Banana, Betel leaf, Brinjal, Cabbage, cauliflower",
  "pest": "Zinc deficiency",
  "symptoms": "Yellowing of leaves, stunted growth, reduced leaf size, poor fruit development",
  "causes": "Zinc deficiency in soil affecting plant growth and development",
  "product_tags": [
    "mczinc",
    "hepta",
    "zinc sulphate",
    "fertilizer"
  ],
  "product_price": "",
  "reg_no": "IMP 1117",
  "serial_no": "2",
  "product_url": "https://www.mcdonaldbd.com/product/mczinc-hepta/",
  "origin": "China",
  "isActive": "true",
  "Stocks": "3654",
  "extraction_date": "2025-10-15T00:00:00"
}
